Revit 2026 API

# AlphanumericRevisionSettingsSetSequence Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetSequence(
	IList<string> sequence
)
```
```vb
Public Sub SetSequence (
	sequence As IList(Of String)
)
```
```cpp
public:
void SetSequence(
	IList<String^>^ sequence
)
```
```fsharp
member SetSequence :
        sequence : IList<string> -> unit
```

#### Parameters

sequence IListString

#### Reference

AlphanumericRevisionSettings Class

Autodesk.Revit.DB Namespace